hotel-list-api/app/controllers/extras_controller.rb

SELECT "extras".* FROM "extras"
---
  def index
    @extras = Extra.all