app/controllers/hotel_rooms_controller.rb

  def index
    @hotel_rooms = HotelRoom.all
---
SELECT "hotel_rooms".* FROM "hotel_rooms"