app/controllers/user_reservations_controller.rb

  def index
    @user_reservations = UserReservation.all
---
SELECT "user_reservations".* FROM "user_reservations"

  def create
    @user_reservation = UserReservation.new(user_reservation_params)

    if @user_reservation.save
---
INSERT INTO "user_reservations" ("userName", "phoneNumber", "email", "address", "card", "cvc", "checkIn", "checkOut", "roomName", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    # if @user_reservation.update(user_reservation_params)
    #   render json: @user_reservation
    # else
    #   render json: @user_reservation.errors, status: :unprocessable_entity
    # end
    userReservation = UserReservation.find(params[:id])
---
SELECT "user_reservations".* FROM "user_reservations" WHERE "user_reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    # @user_reservation.destroy
    userReservation = UserReservation.find(params[:id])
    userReservation.destroy()
---
SELECT "user_reservations".* FROM "user_reservations" WHERE "user_reservations"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "user_reservations" WHERE "user_reservations"."id" = ?  [["id", 1]]

    def set_user_reservation
      @user_reservation = UserReservation.find(params[:id])
---
SELECT "user_reservations".* FROM "user_reservations" WHERE "user_reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]